eisup_2019_docmng_integration/src/InformationRegisters/абс_ЛимитыПоКонтрагентам/абс_ЛимитыПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЛимитыПоКонтрагентам</name>
  <resources>
    <name>ЛимитМесячный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛимитДляСчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЛимитыПоКонтрагентам/ManagerModule.bsl
Функция ПревышенПорогСогласованияПоКонтрагенту(Сумма,Контрагент) Экспорт
	
	ПределПревышен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Сумма > абс_ЛимитыПоКонтрагентам.ЛимитДляСчетов
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПределПревышен
		|ИЗ
		|	РегистрСведений.абс_ЛимитыПоКонтрагентам КАК абс_ЛимитыПоКонтрагентам
		|ГДЕ
		|	абс_ЛимитыПоКонтрагентам.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Сумма", Сумма);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПределПревышен = ВыборкаДетальныеЗаписи.ПределПревышен;	
	КонецЕсли;

    Возврат ПределПревышен;
	
КонецФункции
